In [10]:
#%run create_tables.py
#%load creat_tables.py -do not need

In [11]:
%reload_ext sql

In [12]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [13]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 4, 0, 50, 3, 796000), 99, 'free', None, None, 124, 'Salt Lake City, UT', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (2, datetime.datetime(2018, 11, 4, 2, 54, 52, 796000), 43, 'free', None, None, 42, 'San Antonio-New Braunfels, TX', '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 4, 2, 58, 57, 796000), 43, 'free', None, None, 42, 'San Antonio-New Braunfels, TX', '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 4, 3, 2, 20, 796000), 43, 'free', None, None, 42, 'San Antonio-New Braunfels, TX', '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 4, 4, 35, 52, 796000), 6, 'free', None, None, 225, 'Atlanta-Sandy Springs-Roswell, GA', 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:32.0) Gecko/20100101 Firefox/32.0')]

In [14]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(83, 'Stefany', 'White', 'F', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (80, 'Tegan', 'Levine', 'F', 'free'),
 (33, 'Bronson', 'Harris', 'M', 'free')]

In [15]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, Decimal('337.68444'))]

In [16]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR62SOJ1187FB47BB5', 'Chase & Status', '', nan, nan)]

In [17]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 4, 0, 50, 3, 796000), 0, 4, 44, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 4, 2, 54, 52, 796000), 2, 4, 44, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 4, 2, 58, 57, 796000), 2, 4, 44, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 4, 3, 2, 20, 796000), 3, 4, 44, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 4, 4, 35, 52, 796000), 4, 4, 44, 11, 2018, '6')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).